{"India":{"marriageRegistration":"NRIs can marry under the Special Marriage Act, 1954, which allows for a civil marriage. The Foreign Marriage Act, 1969, facilitates marriages abroad if at least one party is an Indian citizen.","divorceJurisdiction":"Indian courts can hear cases if either party resides in India. For NRIs, a decree of divorce obtained abroad is recognized in India if granted on grounds recognized under Indian law.","childCustody":"Indian courts emphasize the child's welfare. For NRIs, custody battles often involve considerations of jurisdiction and the child's habitual residence.","propertyDivision":"In case of divorce, the division of marital property depends on whether the couple married under Hindu, Muslim, Christian, or other personal laws."},"Pakistan":{"marriageRegistration":"NRIs can marry under Muslim Family Laws Ordinance, 1961, for Muslims, or other religious personal laws. Overseas marriages are recognized if solemnized according to local customs.","divorceJurisdiction":"Pakistani law accepts divorces granted by foreign courts if the marriage was registered there and the parties had a connection with the jurisdiction. For Muslims, talaq (divorce) must be notified to local authorities for recognition.","childCustody":"Generally favors the mother for young children, with the father's rights increasing as the child ages. The \"best interests of the child\" principle applies.","propertyDivision":"Islamic law principles dictate property rights, often leaving limited claims for women in divorce."},"Bangladesh":{"marriageRegistration":"Governed by personal law based on religion. For Muslims, the Muslim Marriages and Divorces (Registration) Act, 1974 applies. Civil marriages are not as prevalent.","divorceJurisdiction":"Divorce cases involving NRIs are recognized if filed according to Bangladeshi law. Overseas divorces can face non-recognition if not aligned with local laws.","childCustody":"Similar to Pakistan, with mothers having priority for young children.","propertyDivision":"Personal law governs property distribution, and in many cases, it follows Islamic inheritance rules."},"Sri Lanka":{"marriageRegistration":"Marriage and divorce laws differ by religion (Buddhist, Hindu, Muslim, Christian). The General Marriage Registration Ordinance, 1907, allows civil marriages.\r","divorceJurisdiction":"Sri Lankan courts can take jurisdiction if at least one spouse is domiciled in Sri Lanka. Divorce laws vary by religious group.\r","childCustody":"Based on the best interest of the child, with no automatic preference to either parent.\r","propertyDivision":"Marital property laws depend on community practices. \"Matrimonial rights and inheritance ordinances\" govern property division."},"Nepal":{"marriageRegistration":"NRIs must register marriages under the Marriage Registration Act, 1971, for civil marriages. Recognition of overseas marriages may vary.\r","divorceJurisdiction":"Nepali courts have jurisdiction if one spouse resides in Nepal. Recognition of foreign divorces depends on alignment with Nepali law.\r","childCustody":"Decisions prioritize the welfare of the child. Foreign judgments regarding custody are not always enforceable.\r","propertyDivision":"Marital property is divided based on contributions to the family. Women can claim equal property rights upon divorce."},"China":{"marriageRegistration":"NRs can register marriages through Chinese laws. Recognition of foreign marriages exists if notarized and authenticated.","divorceJurisdiction":"China requires residency for at least one party in the jurisdiction. Courts may reject foreign divorce decrees not meeting Chinese standards.","childCustody":"Decisions are guided by the child’s best interests, often leading to joint custody arrangements.","propertyDivision":"Follows the principle of joint ownership of property acquired during marriage, while pre-marital assets remain personal."},"Japan":{"marriageRegistration":"Foreign marriages are recognized if properly registered in Japan. NRIs can marry through local embassies.\r","divorceJurisdiction":"Japanese courts require residency for at least one party. Foreign divorces are recognized if compliant with Japanese principles of fairness.\r","childCustody":"Single-parent custody is common, with one parent given full responsibility. Joint custody is not recognized after divorce.\r","propertyDivision":"Courts divide marital property equitably, considering factors like financial contributions and duration of marriage."},"South Korea":{"marriageRegistration":"Marriage registration is essential for legal recognition. Overseas marriages must be reported to local authorities.\r","divorceJurisdiction":"Courts require that one spouse is a resident. Divorce grounds must conform to South Korean law.\r","childCustody":"Custody determinations are guided by the best interest of the child, usually leading to one parent being awarded custody.\r","propertyDivision":"Courts divide property acquired during the marriage equitably."},"Singapore":{"marriageRegistration":"Marriage can be registered under the Women's Charter, or under the Administration of Muslim Law Act for Muslims.\r","divorceJurisdiction":"Singapore courts have jurisdiction if one spouse is domiciled or has resided in Singapore for at least three years.\r","childCustody":"Decisions consider the child’s welfare. Joint custody is favored, though one parent may have primary care.\r","propertyDivision":"Courts have broad discretion to divide matrimonial assets equitably."},"Afghanistan":{"marriageRegistration":"Governed by Islamic law (Sharia), marriage contracts (Nikah Nama) must comply with local customs. Recognition of foreign marriages may vary. \r","divorceJurisdiction":"Afghan courts handle divorces if either spouse is domiciled there. Foreign divorces are not always recognized, especially if not conducted under Islamic principles.\r","childCustody":"Typically follows Islamic law, favoring the mother for young children. The father often retains legal guardianship.\r","propertyDivision":"Islamic inheritance law applies, with limited rights for women to claim marital property."},"Myanmar":{"marriageRegistration":"Governed by religious laws. Civil marriages are not common; marriages are typically registered under Buddhist, Hindu, or Muslim laws. \r","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in Myanmar. Foreign divorces are recognized if in line with Myanmar's laws.\r","childCustody":"Decisions prioritize the child's welfare, with parents often given joint custody.\r","propertyDivision":"Property rights during divorce depend on the respective religious laws governing the marriage."},"Thailand":{"marriageRegistration":"Marriage registration under Thai law is required for legal recognition. Foreign marriages are recognized if registered and documented appropriately.\r","divorceJurisdiction":"Requires one spouse to be domiciled or resident in Thailand. Foreign divorces may be recognized if they meet the local legal standards.\r","childCustody":"Courts favor the child’s welfare in custody cases. Joint custody is possible, but courts often award sole custody to one parent.\r","propertyDivision":"Marital assets are divided based on community property principles, with each spouse entitled to half of jointly owned property."},"Vietnam":{"marriageRegistration":"Marriage must be registered with Vietnamese authorities for recognition. Foreign marriages are recognized if documented and authenticated.\r","divorceJurisdiction":"Vietnamese courts handle divorces where one spouse is a citizen or has residency. Recognition of foreign divorces is contingent on compliance with local standards.\r","childCustody":"Decisions prioritize the child's interests, with joint custody being an option.\r","propertyDivision":"Marital assets are split equally unless otherwise agreed upon in a prenuptial agreement."},"Indonesia":{"marriageRegistration":"Governed by religious laws, with civil marriages uncommon. Non-Muslims must follow civil law registration, while Muslims follow Islamic law.","divorceJurisdiction":"Islamic courts govern Muslim divorces. Civil courts handle non-Muslim divorces. Foreign divorces may be recognized if compliant with Indonesian principles.","childCustody":"Islamic law for Muslims usually grants custody to the mother for young children, while other factors influence civil cases.","propertyDivision":"Islamic law principles apply for Muslims, with marital property often divided according to prenuptial agreements or based on contributions."},"Philippines":{"marriageRegistration":"Marriages are registered under the Family Code for civil recognition. The Philippines does not recognize divorce for Filipinos, except for Muslims under specific conditions.","divorceJurisdiction":"Foreign divorce decrees are only recognized if filed by a foreigner, allowing the Filipino spouse to remarry. Muslim divorces are governed by the Code of Muslim Personal Laws.","childCustody":"Courts prioritize the child's welfare, often favoring the mother for young children.","propertyDivision":"The principle of absolute community of property applies, meaning assets acquired during the marriage are considered jointly owned."},"Cambodia":{"marriageRegistration":"Civil marriages must be registered with local authorities. Recognition of foreign marriages requires proper documentation. ","divorceJurisdiction":"Cambodian courts can handle divorces where at least one spouse is a resident. Foreign divorce decrees may be recognized if not contrary to local laws.","childCustody":"Follows the \"best interests of the child\" principle, allowing joint or sole custody arrangements.","propertyDivision":"Marital property is typically divided equally, regardless of who acquired it."},"Laos":{"marriageRegistration":"Marriage laws require registration with local authorities. Recognition of foreign marriages depends on documentation and compliance with Laotian law.\r","divorceJurisdiction":"Courts can hear divorce cases if one spouse resides in Laos. Recognition of foreign divorces is contingent on compliance with local legal principles.\r","childCustody":"The child's welfare is the primary consideration. Courts may award joint or sole custody.\r","propertyDivision":"Property acquired during the marriage is divided equitably, considering contributions."},"Maldives":{"marriageRegistration":"Governed by Islamic law, with all marriages being religious. Overseas marriages must comply with Sharia to be recognized.","divorceJurisdiction":"Islamic principles guide divorce cases. Foreign divorces may be recognized if the marriage was conducted according to Sharia.","childCustody":"Custody decisions are based on Islamic law, generally favoring mothers for young children.","propertyDivision":"Islamic inheritance rules govern property division in divorce cases."},"Kazakhstan":{"marriageRegistration":"Governed by civil law. Marriages conducted abroad are recognized if registered and authenticated.","divorceJurisdiction":"Courts can take jurisdiction if one spouse is a resident. Foreign divorce decrees are recognized if compliant with Kazakh law.","childCustody":"Decisions prioritize the welfare of the child, with both parents having the potential to gain custody.","propertyDivision":"Follows the principle of joint ownership, with assets acquired during the marriage considered joint property."},"Malaysia":{"marriageRegistration":"Governed by civil law for non-Muslims and Syariah law for Muslims. Marriages abroad must be registered in Malaysia.","divorceJurisdiction":"Non-Muslims follow civil divorce laws, while Muslims are governed by Syariah courts. Foreign divorces are recognized if obtained following local legal principles.","childCustody":"Follows Islamic law for Muslims, emphasizing the child’s welfare.","propertyDivision":"Division of assets is based on contributions to the marriage, and Islamic principles apply to Muslims."},"Uzbekistan":{"marriageRegistration":"Civil law governs marriage, requiring registration. Foreign marriages are recognized with proper documentation.","divorceJurisdiction":"Courts have jurisdiction if one spouse is domiciled in Uzbekistan. Recognition of foreign divorces depends on conformity with local law.","childCustody":"The \"best interests of the child\" principle applies, with no automatic preference for either parent.","propertyDivision":"Marital property is considered joint and divided equitably."},"Saudi Arabia":{"marriageRegistration":"Governed strictly by Islamic law, with all marriages being religious. Foreign marriages must align with Sharia principles.","divorceJurisdiction":"Saudi courts govern divorce under Islamic law, with strict rules on the recognition of foreign divorce decrees.","childCustody":"Follows Islamic principles, with fathers generally having more rights. Custody typically favors mothers for young children.","propertyDivision":"Islamic inheritance rules apply, with limited spousal rights over marital property."},"United Arab Emirates":{"marriageRegistration":"Governed by Islamic law for Muslims and civil law for non-Muslims. NRIs may follow local embassies' rules.","divorceJurisdiction":"Islamic principles govern Muslim divorces, while non-Muslims can follow civil laws. Recognition of foreign divorces is possible under specific conditions.","childCustody":"Custody decisions consider Islamic principles, with fathers holding legal guardianship and mothers often granted custody of young children.","propertyDivision":"Typically guided by prenuptial agreements or contributions to marital property, especially for expatriates."},"Iran":{"marriageRegistration":"Governed by Islamic law. Foreign marriages must meet Sharia requirements for recognition.","divorceJurisdiction":"Divorce follows Islamic law principles, and foreign divorces may not be recognized if not aligned with Sharia.","childCustody":"Custody laws favor mothers for young children but shift towards fathers as children age.","propertyDivision":"Islamic law dictates property division, with women often having limited rights to claim marital property."},"Turkey":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional.","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in Turkey.","childCustody":"Decisions prioritize the child’s best interests.","propertyDivision":"Marital property is divided equitably."},"Iraq":{"marriageRegistration":"Governed by Islamic law, requiring marriages to comply with local customs. Foreign marriages are recognized if they adhere to Sharia principles.","divorceJurisdiction":"Islamic courts handle divorce cases, and foreign divorces may not be recognized if they conflict with Sharia.","childCustody":"Custody is guided by Islamic principles, typically favoring the mother for young children.","propertyDivision":"Property distribution follows Islamic inheritance rules, with fewer rights for spouses, particularly women, in divorce cases."},"Jordan":{"marriageRegistration":"Governed by Islamic law for Muslims and civil law for Christians. Overseas marriages are recognized if compliant with Jordanian law.","divorceJurisdiction":"Islamic courts govern Muslim divorces. Christian divorces follow ecclesiastical law. Foreign divorces are recognized if they align with local principles.","childCustody":"Custody favors mothers for young children, but fathers usually retain legal guardianship.","propertyDivision":"Governed by Islamic law, with marital property typically considered separate unless an agreement is in place."},"Lebanon":{"marriageRegistration":"Religious laws govern marriage, with separate laws for Muslims, Christians, and Druze. Civil marriages conducted abroad are recognized.","divorceJurisdiction":"Courts handle divorces according to the couple's religion. Foreign divorce decrees are recognized if consistent with local religious laws.","childCustody":"Custody follows religious principles, often favoring the mother for young children.","propertyDivision":"Varies by religious sect, with Islamic laws often favoring men in inheritance and property division."},"Qatar":{"marriageRegistration":"Islamic law governs marriages. Foreign marriages must be registered with local authorities for recognition.","divorceJurisdiction":"Islamic courts handle divorces. Foreign divorce decrees may be recognized if compliant with Islamic principles.","childCustody":"Islamic law favors the mother for young children, but fathers retain legal guardianship rights.","propertyDivision":"Property distribution follows Sharia law, with limited spousal rights to marital property."},"Kuwait":{"marriageRegistration":"Marriages are governed by Islamic law for Muslims. Foreign marriages are recognized if registered and in line with local customs.","divorceJurisdiction":"Islamic courts have jurisdiction over divorces, and foreign divorces may not be recognized unless compliant with Sharia.","childCustody":"Custody often favors mothers for young children, with the father's guardianship rights prevailing.","propertyDivision":"Islamic law governs property distribution, limiting spousal claims to marital assets."},"Bahrain":{"marriageRegistration":"Islamic law governs Muslim marriages, while civil law applies to others. Foreign marriages must comply with local laws for recognition.","divorceJurisdiction":"Islamic courts oversee divorces for Muslims. Foreign divorces may be recognized if they do not conflict with Bahraini law.","childCustody":"Custody laws favor mothers for young children, while fathers retain guardianship.","propertyDivision":"Property is divided according to Islamic law, with inheritance rules governing distribution."},"Oman":{"marriageRegistration":"Islamic law governs marriages, with foreign marriages recognized if registered and aligned with Sharia.","divorceJurisdiction":"Divorce is handled by Islamic courts. Foreign divorces may be recognized if consistent with Islamic principles.","childCustody":"Custody generally favors the mother for young children, while the father has guardianship.","propertyDivision":"Marital property is divided according to Sharia law, with inheritance rules often dictating the outcome."},"Syria":{"marriageRegistration":"Islamic law governs marriages for Muslims, while other religions have their own marriage rules. Foreign marriages can be recognized if properly registered.","divorceJurisdiction":"Islamic principles govern divorces. Foreign divorces may not be recognized if inconsistent with local religious laws.","childCustody":"Islamic law typically favors mothers for young children, but legal guardianship remains with the father.","propertyDivision":"Follows Sharia law for Muslims, with limited rights for spouses to claim marital property."},"North Korea\n":{"marriageRegistration":"Governed by state laws, marriage must be registered for legal recognition. Foreign marriages may not be recognized without proper registration.","divorceJurisdiction":"Divorce is handled within the country, with foreign decrees not typically recognized.","childCustody":"The state has significant control over custody decisions, which are based on state interests rather than individual preferences.","propertyDivision":"Marital property division is influenced by state policies and may not follow typical ownership rights."},"Mongolia":{"marriageRegistration":"Marriage must be registered under civil law to be legally recognized. Foreign marriages are acknowledged if properly documented.","divorceJurisdiction":"Courts can hear divorce cases if one spouse resides in Mongolia. Foreign divorce decrees may be recognized if they align with Mongolian legal standards.","childCustody":"The \"best interests of the child\" principle applies, with courts making custody decisions accordingly.","propertyDivision":"Marital property is divided equitably, based on contributions and agreements made during the marriage."},"Brunei":{"marriageRegistration":"Islamic law governs Muslim marriages, while civil law applies to others. Recognition of foreign marriages requires registration with local authorities.","divorceJurisdiction":"Islamic courts govern Muslim divorces, while civil courts handle non-Muslim divorces. Foreign divorce recognition depends on compliance with local legal principles.","childCustody":"Custody laws follow Islamic principles for Muslims, generally favoring mothers for young children.","propertyDivision":"Property division follows Sharia law, limiting claims to marital assets."},"Yemen":{"marriageRegistration":"Governed strictly by Islamic law, and all marriages must comply with Sharia. Recognition of foreign marriages may vary.","divorceJurisdiction":"Islamic principles guide divorce cases. Foreign divorces are recognized if in accordance with Sharia.","childCustody":"Custody generally favors the mother for young children under Islamic law.","propertyDivision":"Distribution follows Sharia, often providing limited spousal rights to marital assets."},"Timor-Leste":{"marriageRegistration":"Governed by civil law, marriages must be registered with local authorities to be legally recognized. Foreign marriages are recognized if properly documented.","divorceJurisdiction":"Courts have jurisdiction over divorces if one spouse is domiciled in Timor-Leste. Foreign divorces may be recognized if they meet local legal standards.","childCustody":"Custody decisions are based on the best interests of the child, with joint custody being an option.","propertyDivision":"Marital property is divided equitably, with contributions and the needs of each spouse considered."},"Palestine":{"marriageRegistration":"Marriage is governed by Islamic law for Muslims, and religious laws for other communities. Foreign marriages are recognized if they align with local customs and religious laws.","divorceJurisdiction":"Islamic courts govern divorce for Muslims, while other religious communities follow their own legal frameworks. Foreign divorces may not always be recognized if they conflict with local religious norms.","childCustody":"Custody decisions favor mothers for young children, but legal guardianship usually belongs to the father.","propertyDivision":"Governed by Islamic law, with property rights favoring men in inheritance and distribution."},"Armenia":{"marriageRegistration":"Governed by civil law, marriages must be registered for legal recognition. Foreign marriages are recognized if documented and compliant with Armenian law.","divorceJurisdiction":"Armenian courts handle divorces if one spouse resides in the country. Foreign divorces are recognized under local standards.","childCustody":"The best interests of the child guide custody decisions, with joint or sole custody arrangements being considered.","propertyDivision":"Marital property acquired during the marriage is generally divided equitably."},"Azerbaijan":{"marriageRegistration":"Civil law governs marriage registration. Foreign marriages are recognized if documented properly.","divorceJurisdiction":"Courts can take jurisdiction if one spouse resides in Azerbaijan. Foreign divorces may be recognized if in accordance with local law.","childCustody":"Custody decisions are based on the child's best interests, with no automatic preference for either parent.","propertyDivision":"Marital property is divided equitably, considering contributions and financial circumstances."},"United Kingdom":{"marriageRegistration":"Marriages performed overseas are recognized if legally valid in the country where they took place. Registration with the local consulate is recommended for documentation.","divorceJurisdiction":"Courts can grant a divorce if either spouse is domiciled or habitually resident in the UK. Foreign divorces are recognized if legally valid under local law.","childCustody":"The \"best interests of the child\" principle applies. Joint custody and parental responsibility are common, considering the child’s welfare.","propertyDivision":"Divorce settlements aim for equitable distribution, considering both spouses' financial contributions and future needs."},"France":{"marriageRegistration":"Marriages performed abroad are recognized if valid under local law. Registration at the French consulate can help with documentation.","divorceJurisdiction":"French courts have jurisdiction if either spouse resides in France. Foreign divorces are recognized under certain conditions.","childCustody":"Decisions prioritize the welfare of the child. Joint custody is common, with both parents maintaining rights and responsibilities.","propertyDivision":"Property acquired during the marriage is divided equitably, with prenuptial agreements considered if in place."},"Germany":{"marriageRegistration":"Overseas marriages are recognized if compliant with local laws. Registration at the German consulate is not mandatory but may help document the marriage.","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in Germany. Foreign divorces may be recognized if legally valid.","childCustody":"The child’s best interests are prioritized, and joint custody is generally encouraged.","propertyDivision":"Marital assets are divided based on the principle of equitable distribution, considering the couple's economic situation."},"Italy":{"marriageRegistration":"Overseas marriages are recognized if legally valid. Registration with the Italian consulate can aid documentation.","divorceJurisdiction":"Courts can handle divorces if either spouse resides in Italy. Foreign divorce decrees are recognized if they do not violate public policy.","childCustody":"Custody is awarded based on the best interests of the child, with joint custody being common.","propertyDivision":"Marital assets are divided based on the \"community of property\" regime unless otherwise agreed."},"Spain":{"marriageRegistration":"Marriages performed abroad are recognized if they meet local requirements. Registration at the Spanish consulate is recommended.","divorceJurisdiction":"Spanish courts can grant a divorce if one spouse is a resident. Foreign divorces are recognized if consistent with Spanish law.","childCustody":"Custody decisions prioritize the child's welfare. Joint custody is common, especially when both parents are involved in the child’s upbringing.","propertyDivision":"Marital property is typically divided equitably, with prenuptial agreements considered."},"Portugal":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid under the local law. Registration at the Portuguese consulate may be required for documentation.","divorceJurisdiction":"Courts can grant a divorce if one spouse is a resident or citizen. Foreign divorces are recognized if legally valid.","childCustody":"Decisions are based on the child's best interests, with joint custody arrangements common.","propertyDivision":"Marital property acquired during the marriage is divided equitably."},"Netherlands":{"marriageRegistration":"Marriages performed abroad are recognized if they meet local legal requirements. Registration at the consulate is not mandatory but helpful.","divorceJurisdiction":"Dutch courts have jurisdiction if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"The best interests of the child guide custody decisions, with joint custody encouraged.","propertyDivision":"Property division is based on the principle of equitable distribution, considering each spouse’s financial contributions."},"Belgium":{"marriageRegistration":"Recognized if legally valid in the country where performed. Registration at the consulate can help with documentation.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled or habitually resident. Foreign divorces are recognized.","childCustody":"Custody decisions focus on the welfare of the child, with joint custody arrangements common.","propertyDivision":"The \"community property\" regime usually applies unless a prenuptial agreement stipulates otherwise."},"Switzerland":{"marriageRegistration":"Marriages performed abroad are recognized if compliant with local law. Registration at the consulate is recommended.","divorceJurisdiction":"Swiss courts handle divorces if either spouse resides in Switzerland. Foreign divorces are recognized.","childCustody":"The best interests of the child guide custody decisions. Joint custody is generally encouraged.","propertyDivision":"Marital property is divided equitably, considering contributions and financial needs."},"Austria":{"marriageRegistration":"Overseas marriages are recognized if compliant with the law of the country where performed. Registration at the consulate is optional but helpful.","divorceJurisdiction":"Courts can grant a divorce if one spouse resides in Austria. Foreign divorces are recognized under local legal standards.","childCustody":"Custody decisions prioritize the welfare of the child, with joint custody commonly awarded.","propertyDivision":"Equitable distribution principles apply, considering both spouses' economic circumstances."},"Greece":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the Greek consulate is recommended for documentation.","divorceJurisdiction":"Greek courts have jurisdiction if one spouse resides in Greece. Foreign divorces are recognized.","childCustody":"Custody is based on the child's best interests, with joint custody being common.","propertyDivision":"Marital assets are divided equitably, considering prenuptial agreements."},"Sweden":{"marriageRegistration":"Recognized if legally valid abroad. Registration at the Swedish consulate can aid documentation.","divorceJurisdiction":"Courts can grant a divorce if either spouse resides in Sweden. Foreign divorces are recognized.","childCustody":"The welfare of the child is the primary consideration, with joint custody commonly encouraged.","propertyDivision":"Marital property is divided equitably."},"Norway":{"marriageRegistration":"Overseas marriages are recognized if legally performed. Registration with the Norwegian consulate is helpful.","divorceJurisdiction":"Courts have jurisdiction if one spouse is a resident. Foreign divorces are recognized.","childCustody":"Decisions prioritize the child’s best interests, with joint custody being common.","propertyDivision":"Marital property is divided equitably."},"Denmark":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is optional.","divorceJurisdiction":"Danish courts have jurisdiction if one spouse is domiciled in Denmark.","childCustody":"The welfare of the child guides custody decisions, with joint custody arrangements common.","propertyDivision":"Marital property is divided based on equitable distribution."},"Finland":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the Finnish consulate can be beneficial.","divorceJurisdiction":"Courts handle divorces for residents. Foreign divorces are recognized if legally valid.","childCustody":"Decisions prioritize the best interests of the child, with joint custody arrangements common.","propertyDivision":"Marital assets are divided equitably."},"Ireland":{"marriageRegistration":"Overseas marriages are recognized if legally valid in the country where they took place.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Ireland. Foreign divorces may be recognized if compliant with local standards.","childCustody":"Custody decisions prioritize the child's welfare, with joint custody being common.","propertyDivision":"Equitable distribution principles apply."},"Iceland":{"marriageRegistration":"Overseas marriages are recognized if legally performed. Registration at the consulate is not mandatory but useful.","divorceJurisdiction":"Courts can grant a divorce if either spouse is domiciled in Iceland.","childCustody":"The best interests of the child are considered in custody decisions.","propertyDivision":"Equitable distribution of marital assets is standard."},"Poland":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is not mandatory but recommended.","divorceJurisdiction":"Courts can grant a divorce if one spouse resides in Poland. Foreign divorces may be recognized if they comply with Polish law.","childCustody":"Decisions prioritize the best interests of the child, with joint custody arrangements common.","propertyDivision":"Marital property is divided equitably based on contributions during the marriage."},"Czech Republic":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but useful.","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in the Czech Republic. Foreign divorces may be recognized under local legal standards.","childCustody":"The child's best interests guide custody decisions, with joint custody being common.","propertyDivision":"Marital property is divided equitably, considering financial contributions and future needs."},"Hungary":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is advisable for documentation purposes.","divorceJurisdiction":"Courts can grant a divorce if either spouse resides in Hungary. Foreign divorces may be recognized.","childCustody":"Custody decisions focus on the child’s best interests, with joint custody arrangements frequently considered.","propertyDivision":"Marital property is divided equitably, considering contributions and financial circumstances."},"Slovakia":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is not mandatory but recommended for documentation.","divorceJurisdiction":"Courts have jurisdiction if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"The best interests of the child are prioritized in custody cases, with joint custody being common.","propertyDivision":"Marital assets are divided equitably, based on contributions and future needs."},"Slovenia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the Slovenian consulate is optional.","divorceJurisdiction":"Slovenian courts handle divorces if either spouse resides in Slovenia. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the welfare of the child, often considering joint custody.","propertyDivision":"Marital property is divided equitably, with considerations for financial contributions."},"Croatia\n":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is advisable for documentation.","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in Croatia. Foreign divorces may be recognized.","childCustody":"The child's best interests guide custody decisions, with joint custody often considered.","propertyDivision":"Equitable distribution of marital assets applies."},"Bosnia and Herzegovina":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but useful.","divorceJurisdiction":"Courts can grant a divorce if one spouse resides in Bosnia and Herzegovina. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the child’s best interests.","propertyDivision":"Marital property is divided equitably."},"Serbia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the Serbian consulate is recommended for documentation.","divorceJurisdiction":"Courts can handle divorces if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"Decisions prioritize the child’s welfare, with joint custody arrangements being common.","propertyDivision":"Equitable distribution of marital property applies."},"Montenegro":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but useful.","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in Montenegro. Foreign divorces may be recognized.","childCustody":"Custody decisions focus on the child's best interests, often favoring joint custody.","propertyDivision":"Marital property is divided equitably."},"North Macedonia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is not mandatory.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in North Macedonia. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the best interests of the child, with joint custody being common.","propertyDivision":"Marital assets are divided equitably."},"Albania":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate can be useful.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Albania. Foreign divorces may be recognized.","childCustody":"The best interests of the child guide custody decisions.","propertyDivision":"Equitable distribution principles apply."},"Bulgaria":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the Bulgarian consulate is optional.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Bulgaria. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the child’s best interests, with joint custody arrangements being common.","propertyDivision":"Marital property is divided equitably."},"Romania":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is recommended for documentation.","divorceJurisdiction":"Courts have jurisdiction if one spouse is domiciled or habitually resident in Romania.","childCustody":"The child’s welfare is a key consideration in custody decisions.","propertyDivision":"Equitable distribution of marital assets is the standard."},"Moldova":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but recommended.","divorceJurisdiction":"Courts can grant divorces if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"The best interests of the child guide custody decisions, with joint custody arrangements common.","propertyDivision":"Marital assets are divided equitably."},"Ukraine":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional.","divorceJurisdiction":"Courts handle divorces if one spouse resides in Ukraine.","childCustody":"Custody decisions prioritize the child’s welfare.","propertyDivision":"Equitable distribution of marital property applies."},"Belarus":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is not mandatory but useful.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled in Belarus.","childCustody":"The welfare of the child is the primary consideration.","propertyDivision":"Marital property is divided equitably."},"Latvia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional.","divorceJurisdiction":"Courts handle divorces if one spouse resides in Latvia.","childCustody":"Custody decisions prioritize the child’s best interests.","propertyDivision":"Equitable distribution of marital property applies."},"Lithuania":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is recommended.","divorceJurisdiction":"Courts can grant divorces if one spouse is a resident.","childCustody":"Decisions are based on the child’s welfare.","propertyDivision":"Marital assets are divided equitably."},"Estonia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is useful but not mandatory.","divorceJurisdiction":"Courts have jurisdiction if one spouse resides in Estonia.","childCustody":"The welfare of the child is the primary consideration.","propertyDivision":"Equitable distribution principles apply."},"Russia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but useful.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Russia.","childCustody":"Custody decisions focus on the child’s best interests.","propertyDivision":"Marital property is divided equitably."},"United States of America":{"marriageRegistration":"Marriages performed abroad are recognized if they are legally valid in the country where they took place. Registration with the local consulate is not required but can help with documentation.","divorceJurisdiction":"Divorce is governed by state law, with each state having its own residency requirements for divorce. Generally, at least one spouse must be a resident of the state where the divorce is filed. Courts may recognize foreign divorces if they meet legal standards.","childCustody":"Decisions are based on the \"best interests of the child.\" Joint custody is common, but the arrangement can vary depending on each state's law.","propertyDivision":"Each state follows different rules. Most states either follow \"community property\" rules (equal division of marital assets) or \"equitable distribution\" (fair, but not necessarily equal, division based on various factors like contribution and needs)."},"Canada":{"marriageRegistration":"Overseas marriages are recognized if they comply with the legal requirements in the country where the marriage was performed. Registration with the Canadian consulate is not mandatory but is beneficial.","divorceJurisdiction":"Divorce is a federal matter, but residency requirements vary by province (typically, one spouse must reside in the province for at least a year). Foreign divorces are recognized if they are valid under the laws of the place where the divorce was granted.","childCustody":"Canadian law prioritizes the child's best interests in custody decisions. Joint custody is common, and courts often favor arrangements that keep both parents involved.","propertyDivision":"Division of property upon divorce varies by province. Provinces either follow \"equal division\" or \"equitable division,\" considering factors such as contributions to the marriage and financial circumstances."},"Mexico":{"marriageRegistration":"Foreign marriages are recognized if they comply with the legal requirements in the country where the marriage was performed. Registration with the Mexican consulate is recommended for documentation.","divorceJurisdiction":"Mexican courts can grant a divorce if one spouse is a resident of Mexico. Mexico generally recognizes foreign divorces if they meet the country's legal standards.","childCustody":"Custody decisions prioritize the child's best interests, often resulting in joint custody arrangements.","propertyDivision":"Marital property is typically divided according to the \"community property\" regime unless a prenuptial agreement specifies otherwise."},"Guatemala":{"marriageRegistration":"Marriages performed abroad are recognized if they are legally valid in the country where they took place. Registration with the Guatemalan consulate is not required but can be helpful.","divorceJurisdiction":"Courts have jurisdiction if one spouse is domiciled in Guatemala. Foreign divorces may be recognized.","childCustody":"Decisions prioritize the best interests of the child. Joint custody arrangements are considered where appropriate.","propertyDivision":"Marital property is divided equitably, based on the couple's contributions and financial needs."},"Belize":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the place where performed. Registration with the Belizean consulate is optional.","divorceJurisdiction":"Belizean courts handle divorces if one spouse resides in Belize. Foreign divorces may be recognized if compliant with local standards.","childCustody":"Custody decisions focus on the welfare of the child, with joint custody being common.","propertyDivision":"Property acquired during the marriage is generally divided equitably, taking into account the couple’s circumstances."},"Costa Rica":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country where they took place. Registration at the Costa Rican consulate can help with documentation.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Costa Rica. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the best interests of the child, often resulting in joint custody arrangements.","propertyDivision":"Property is divided equitably, taking into account contributions during the marriage and future needs."},"Panama":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the Panamanian consulate is optional but beneficial.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in Panama. Foreign divorces may be recognized if legally valid.","childCustody":"Decisions prioritize the welfare of the child, often leading to joint custody arrangements.","propertyDivision":"Marital property is divided equitably based on contributions and the economic situation of the spouses."},"Honduras":{"marriageRegistration":"Recognized if legally valid in the country where performed. Registration at the consulate is not mandatory but helpful.","divorceJurisdiction":"Courts grant divorces if one spouse is a resident. Foreign divorces may be recognized if they meet local standards.","childCustody":"The child's welfare is the primary consideration in custody cases.","propertyDivision":"Marital property is divided equitably, with factors like contributions and needs taken into account."},"El Salvador":{"marriageRegistration":"Foreign marriages are recognized if legally performed. Registration at the consulate is optional.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in El Salvador. Foreign divorces may be recognized.","childCustody":"Decisions prioritize the child's best interests.","propertyDivision":"Equitable distribution of marital assets is the standard."},"Nicaragua":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is not mandatory but useful.","divorceJurisdiction":"Courts handle divorces if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"Custody decisions focus on the child's welfare.","propertyDivision":"Equitable distribution principles apply to marital property."},"Haiti":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the Haitian consulate is recommended for documentation.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Haiti. Foreign divorces may be recognized.","childCustody":"The child's welfare is prioritized in custody decisions.","propertyDivision":"Marital assets are divided equitably."},"Jamaica":{"marriageRegistration":"Recognized if legally valid abroad. Registration at the Jamaican consulate is not mandatory.","divorceJurisdiction":"Courts grant divorces if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"The best interests of the child guide custody decisions.","propertyDivision":"Equitable distribution of marital property applies."},"Cuba":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is optional but useful.","divorceJurisdiction":"Courts handle divorces if one spouse is domiciled in Cuba. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the welfare of the child.","propertyDivision":"Marital property is divided equitably."},"Dominican Republic":{"marriageRegistration":"Recognized if legally valid abroad. Registration at the consulate is not mandatory.","divorceJurisdiction":"Courts grant divorces if one spouse is a resident. Foreign divorces may be recognized.","childCustody":"The child's welfare is prioritized in custody decisions.","propertyDivision":"Equitable distribution principles apply."},"The Bahamas":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is optional but beneficial.","divorceJurisdiction":"Courts handle divorces if one spouse resides in The Bahamas. Foreign divorces may be recognized.","childCustody":"Custody decisions focus on the child’s welfare, often leading to joint custody arrangements.","propertyDivision":"Marital property is divided equitably."},"Trinidad and Tobago":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the consulate is not mandatory but can help with documentation.","divorceJurisdiction":"Courts grant divorces if one spouse is a resident. Foreign divorces may be recognized if they meet legal standards.","childCustody":"The welfare of the child is the primary consideration in custody cases.","propertyDivision":"Marital property is divided equitably, considering each spouse's contributions."},"Barbados":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country where they took place. Registration with the Barbadian consulate is optional but beneficial for documentation purposes.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in Barbados. Foreign divorces may be recognized if they comply with Barbadian legal standards.","childCustody":"Decisions are made based on the best interests of the child, often leading to joint custody arrangements.","propertyDivision":"Marital assets are divided equitably, taking into account factors like contributions and the financial circumstances of each spouse."},"Saint Lucia":{"marriageRegistration":"Foreign marriages are recognized if they comply with the legal requirements in the country where they were performed. Registration with the Saint Lucian consulate is not mandatory.","divorceJurisdiction":"Courts grant divorces if one spouse is a resident of Saint Lucia. Foreign divorces may be recognized under local legal standards.","childCustody":"The child’s best interests guide custody decisions, often resulting in joint custody.","propertyDivision":"Marital property is divided equitably based on contributions and financial circumstances."},"Grenada":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with the Grenadian consulate is optional.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Grenada. Foreign divorces may be recognized if legally valid abroad.","childCustody":"The best interests of the child are prioritized in custody decisions, often leading to joint custody arrangements.","propertyDivision":"Property acquired during the marriage is divided equitably, considering each spouse's contributions."},"Saint Vincent and the Grenadines":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is not required but can be helpful for documentation.","divorceJurisdiction":"Courts can handle divorces if one spouse is domiciled in Saint Vincent and the Grenadines. Foreign divorces may be recognized if compliant with local standards.","childCustody":"Custody decisions prioritize the child’s welfare, often resulting in joint custody.","propertyDivision":"Marital property is divided equitably, considering contributions during the marriage."},"Antigua and Barbuda":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but recommended.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled in Antigua and Barbuda. Foreign divorces may be recognized if compliant with local laws.","childCustody":"Custody decisions focus on the child’s welfare, with joint custody arrangements common.","propertyDivision":"Marital assets are divided equitably based on contributions and financial needs."},"Saint Kitts and Nevis":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the place of celebration. Registration with the consulate is not mandatory.","divorceJurisdiction":"Courts can handle divorces if one spouse is domiciled in Saint Kitts and Nevis. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the child’s best interests, often favoring joint custody arrangements.","propertyDivision":"Marital property is divided equitably, based on each spouse's contributions and the economic situation."},"Dominic":{"marriageRegistration":"Recognized if legally valid abroad. Registration with the Dominican consulate is optional.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled in Dominica. Foreign divorces may be recognized if they meet local standards.","childCustody":"Custody decisions are based on the best interests of the child, with joint custody often considered.","propertyDivision":"Marital property is divided equitably, based on the couple's circumstances."},"Argentina":{"marriageRegistration":"Marriages performed abroad are recognized if they meet the legal requirements of the country where they took place. Registration with an Argentine consulate is optional but helpful for documentation.","divorceJurisdiction":"Argentina allows divorce if at least one spouse resides in the country. Foreign divorces can be recognized if they comply with Argentine standards.","childCustody":"Custody decisions prioritize the best interests of the child, often leading to joint custody arrangements.","propertyDivision":"Argentina follows a community property regime, meaning marital assets are typically divided equally unless specified otherwise by a prenuptial agreement."},"Brazil":{"marriageRegistration":"Foreign marriages are recognized if they meet the legal requirements of the country where they occurred. Registration with a Brazilian consulate is recommended for legal documentation.","divorceJurisdiction":"Courts handle divorces if one spouse is domiciled in Brazil. Foreign divorces are generally recognized if legally valid abroad.","childCustody":"The child's best interests guide custody decisions, often leading to joint custody.","propertyDivision":"Brazil follows a \"partial community property\" regime where assets acquired during the marriage are divided equally, while individually owned property remains with the original owner."},"Chile":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid where they were conducted. Registration with a Chilean consulate is not required but beneficial.","divorceJurisdiction":"Chilean courts grant divorces if one spouse is a resident. The country may recognize foreign divorces if they comply with local laws.","childCustody":"Decisions are made based on the best interests of the child, often resulting in joint custody arrangements.","propertyDivision":"Property acquired during the marriage is divided equitably, considering each spouse's financial contributions."},"Colombia":{"marriageRegistration":"Foreign marriages are recognized if they meet the legal requirements of the country where they occurred. Registration with a Colombian consulate is optional.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Colombia. Foreign divorces may be recognized if compliant with Colombian law.","childCustody":"The best interests of the child are prioritized in custody cases, often leading to shared custody arrangements.","propertyDivision":"Colombia follows a community property regime, with marital assets being divided equally unless specified differently in a marital agreement."},"Peru":{"marriageRegistration":"Foreign marriages are recognized if they meet legal requirements in the country where they took place. Registration with a Peruvian consulate is not mandatory.","divorceJurisdiction":"Peruvian courts grant divorces if one spouse resides in the country. Foreign divorces may be recognized under local legal standards.","childCustody":"Custody decisions focus on the best interests of the child, often leading to joint custody arrangements.","propertyDivision":"Marital property is divided equitably based on the spouses' financial contributions and needs."},"Venezuela":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with the Venezuelan consulate is optional.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in Venezuela. Foreign divorces may be recognized if they meet Venezuelan legal standards.","childCustody":"The child's welfare is the primary consideration in custody decisions, with joint custody often being favored.","propertyDivision":"Marital assets are divided equitably, based on the contributions and circumstances of each spouse."},"Uruguay":{"marriageRegistration":"Foreign marriages are recognized if they are legally valid in the country where they took place. Registration with a Uruguayan consulate is optional.","divorceJurisdiction":"Uruguayan courts can grant divorces if one spouse resides in Uruguay. Foreign divorces are generally recognized if they comply with local standards.","childCustody":"Custody decisions focus on the best interests of the child, with joint custody being common.","propertyDivision":"Uruguay follows a \"community property\" system where assets acquired during the marriage are shared equally, unless a prenuptial agreement states otherwise."},"Paraguay":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the place where they were performed. Registration at a Paraguayan consulate is optional.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Paraguay. Foreign divorces may be recognized.","childCustody":"Custody decisions are based on the child’s best interests, with joint custody being a common arrangement.","propertyDivision":"Marital assets are divided equitably, considering the spouses' contributions and future needs."},"Ecuador":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the consulate is optional but can help with documentation.","divorceJurisdiction":"Courts can handle divorces if one spouse is domiciled in Ecuador. Foreign divorces may be recognized if they meet Ecuadorian legal standards.","childCustody":"The child's best interests guide custody decisions, often resulting in joint custody.","propertyDivision":"Marital property is divided equitably based on the circumstances and contributions of each spouse."},"Bolivia":{"marriageRegistration":"Foreign marriages are recognized if they are legally valid in the country where they took place. Registration with a Bolivian consulate is optional.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Bolivia. Foreign divorces may be recognized under local standards.","childCustody":"Custody decisions focus on the welfare of the child, with joint custody arrangements commonly considered.","propertyDivision":"Marital assets are divided equitably based on the couple’s contributions and financial situation."},"Guyana":{"marriageRegistration":"Recognized if legally performed abroad. Registration with a Guyanese consulate is not mandatory but can aid in legal documentation.","divorceJurisdiction":"Courts can handle divorces if one spouse is domiciled in Guyana. Foreign divorces may be recognized if they comply with local legal requirements.","childCustody":"The welfare of the child is the primary consideration, often resulting in joint custody arrangements.","propertyDivision":"Marital property is divided equitably based on each spouse's contributions."},"Suriname":{"marriageRegistration":"Recognized if legally valid abroad. Registration at the Surinamese consulate is optional.","divorceJurisdiction":"Courts grant divorces if one spouse is a resident of Suriname. Foreign divorces may be recognized if compliant with Surinamese law.","childCustody":"The best interests of the child guide custody decisions, with joint custody arrangements often being preferred.","propertyDivision":"Marital assets are divided equitably, considering the financial circumstances of each spouse."},"French Guiana":{"marriageRegistration":"Recognized if legally performed abroad. Registration at the French consulate is not mandatory but may help with legal formalities.","divorceJurisdiction":"French law applies to divorces, with courts granting them if one spouse resides in French Guiana. Foreign divorces may be recognized if they meet French legal standards.","childCustody":"French law prioritizes the best interests of the child, often leading to shared custody.","propertyDivision":"Marital property is divided equitably, considering factors such as contributions during the marriage and each spouse's future needs."},"South Africa":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country where they took place. Registration with the South African consulate is recommended for documentation purposes.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled or habitually resides in South Africa. Foreign divorces may be recognized if legally valid.","childCustody":"Decisions are based on the child's best interests, often resulting in shared custody arrangements.","propertyDivision":"South Africa follows different marital regimes (community of property, accrual system, or prenuptial agreement), determining how assets are divided during divorce."},"Nigeria":{"marriageRegistration":"Foreign marriages are recognized if they comply with legal requirements in the country where they occurred. Registration with the Nigerian consulate is optional.","divorceJurisdiction":"Courts can handle divorces if one spouse is domiciled in Nigeria. Foreign divorces are recognized if compliant with local standards.","childCustody":"The child’s welfare is the primary consideration in custody decisions, often resulting in joint custody.","propertyDivision":"Nigerian law does not follow a specific property regime. The division of assets is based on the contributions and needs of each spouse."},"Egypt":{"marriageRegistration":"Recognized if legally valid abroad, but Muslim marriages must comply with Sharia law to be recognized. Registration with Egyptian authorities is beneficial.","divorceJurisdiction":"Divorce is governed by personal status laws (Sharia law for Muslims), with recognition of foreign divorces if legally valid.","childCustody":"Custody is typically granted to mothers for young children, following Sharia principles. Fathers usually obtain custody at a certain age.","propertyDivision":"Sharia law principles apply for Muslims, meaning there is no concept of marital property; assets are divided according to individual ownership."},"Kenya":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the place where they occurred. Registration with the Kenyan authorities is recommended for legal purposes.","divorceJurisdiction":"Kenyan courts grant divorces if one spouse resides in Kenya. Foreign divorces are recognized under local legal standards.","childCustody":"The child’s welfare is the primary consideration, often leading to joint custody arrangements.","propertyDivision":"Property acquired during the marriage is divided equitably based on contributions, financial needs, and other relevant factors."},"Morocco":{"marriageRegistration":"Recognized if legally valid abroad, but for Muslims, the marriage must comply with Islamic law. Registration with Moroccan authorities is advised.","divorceJurisdiction":"Governed by Islamic law for Muslims, which includes provisions for different types of divorce. Foreign divorces may be recognized.","childCustody":"Generally favors mothers for young children; custody can shift to fathers once children reach a certain age.","propertyDivision":"Follows Islamic law, where marital property may not be shared, and assets are divided based on individual ownership."},"Ghana":{"marriageRegistration":"Foreign marriages are recognized if they comply with the legal requirements of the country where they were performed. Registration with the Ghanaian authorities is optional but recommended.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Ghana. Foreign divorces may be recognized if they meet local legal standards.","childCustody":"The child’s welfare is the primary consideration, often resulting in joint custody arrangements.","propertyDivision":"Property acquired during the marriage is typically divided equitably, considering contributions and future needs."},"Ethiopia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with Ethiopian authorities is advised for documentation purposes.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in Ethiopia. Foreign divorces may be recognized if they comply with Ethiopian legal standards.","childCustody":"Custody decisions prioritize the child's best interests, with shared custody arrangements being common.","propertyDivision":"Marital property is divided equitably based on the contributions of each spouse and their financial needs."},"Tanzania":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid where they occurred. Registration with Tanzanian authorities is optional.","divorceJurisdiction":"Tanzanian courts grant divorces if one spouse resides in the country. Foreign divorces may be recognized under local legal standards.","childCustody":"Custody decisions are made in the best interests of the child, often resulting in shared custody arrangements.","propertyDivision":"Marital property is divided equitably based on the couple’s contributions and financial situation."},"Uganda":{"marriageRegistration":"Foreign marriages are recognized if legally performed. Registration with the Ugandan consulate is optional but can aid in documentation.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Uganda. Foreign divorces may be recognized under local standards.","childCustody":"Decisions are made in the best interests of the child, with joint custody arrangements being common.","propertyDivision":"Marital assets are divided equitably, considering each spouse's contributions."},"Rwanda":{"marriageRegistration":"Recognized if legally performed abroad. Registration with Rwandan authorities is recommended for documentation purposes.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled in Rwanda. Foreign divorces may be recognized if they meet local standards.","childCustody":"Custody decisions prioritize the child’s welfare, often resulting in shared custody arrangements.","propertyDivision":"Marital property is divided equitably, based on each spouse's contributions and financial needs."},"Botswana":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the Botswana consulate is not mandatory but can be useful.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled in Botswana. Foreign divorces may be recognized.","childCustody":"Custody decisions are based on the best interests of the child, often resulting in shared custody.","propertyDivision":"Marital property is divided equitably, based on contributions and financial circumstances."},"Algeria":{"marriageRegistration":"Recognized if legally valid abroad, but must align with Islamic law for Muslims. Registration with Algerian authorities is recommended.","divorceJurisdiction":"Governed by Islamic law for Muslims, with foreign divorces recognized if compliant with local standards.","childCustody":"Follows Sharia principles; mothers usually get custody of young children, with custody shifting to fathers as the children grow older.","propertyDivision":"Based on Islamic law, which generally does not share marital property; assets are divided according to ownership."},"Zimbabwe":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with Zimbabwean authorities is optional.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Zimbabwe. Foreign divorces may be recognized under local standards.","childCustody":"The child’s welfare is the primary factor in custody decisions, with joint custody being a common arrangement.","propertyDivision":"Equitable division of marital property based on each spouse’s contributions and financial situation."},"Sudan":{"marriageRegistration":"Recognized if legally performed abroad, but for Muslims, marriages must conform to Sharia law. Registration with Sudanese authorities is advisable.","divorceJurisdiction":"Governed by Islamic law for Muslims, with foreign divorces being recognized if they meet legal standards.","childCustody":"Sharia principles apply, typically giving custody of young children to mothers and transferring custody to fathers at a certain age.","propertyDivision":"Follows Islamic law, where marital property is not necessarily shared; assets are divided based on ownership."},"Namibia":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid. Registration with Namibian authorities is optional.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in Namibia. Foreign divorces may be recognized if compliant with local laws.","childCustody":"Decisions are based on the child’s best interests, with shared custody often considered.","propertyDivision":"Marital property is divided equitably based on each spouse's contributions and financial situation."},"Seychelles":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Seychelles authorities is recommended for documentation.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Seychelles. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the child’s welfare, often resulting in shared custody.","propertyDivision":"Marital assets are divided equitably, based on the couple's contributions."},"Zambia":{"marriageRegistration":"Recognized if legally performed abroad. Registration with the Zambian authorities is optional.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Zambia. Foreign divorces may be recognized if they meet local standards.","childCustody":"Marriage Registration: Recognized if legally performed abroad. Registration with the Zambian authorities is optional.Divorce Jurisdiction: Courts grant divorces if one spouse resides in Zambia. Foreign divorces may be recognized if they meet local standards.Child Custody: ","propertyDivision":"ion: Recognized if legally performed abroad. Registration with the Zambian authorities is optional.Divorce Jurisdiction: Courts grant divorces if one spouse resides in Zambia. Foreign divorces may be recognized if they meet local standards.Child Custody: The welfare of the child guides custody decisions, with joint custody"},"Mozambique":{"marriageRegistration":"Foreign marriages are recognized if legally valid where they occurred. Registration with Mozambican authorities is recommended for legal purposes.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled or resides in Mozambique. Foreign divorces may be recognized under local laws.","childCustody":"Custody decisions prioritize the child’s best interests, with joint custody arrangements being common.","propertyDivision":"Marital property is divided equitably, based on contributions made by each spouse and their financial situation."},"Madagascar":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with Malagasy authorities is advised for documentation.","divorceJurisdiction":"Divorce is granted if one spouse resides in Madagascar. Foreign divorces may be recognized if compliant with local standards.","childCustody":"Custody is decided based on the child's welfare, with joint custody arrangements often preferred.","propertyDivision":"Marital assets are divided equitably, considering the contributions of each spouse and their future financial needs."},"Mauritius":{"marriageRegistration":"Foreign marriages are recognized if legally performed. Registration with the Mauritian authorities is advised for legal documentation.","divorceJurisdiction":"Divorce is granted if one spouse resides in Mauritius. Foreign divorces may be recognized if they meet local standards.","childCustody":"The child’s welfare is the priority, and joint custody is commonly awarded.","propertyDivision":"Marital property is divided equitably, based on contributions, with a focus on the financial needs of each spouse."},"Malawi":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country where they occurred. Registration with Malawian authorities is recommended.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Malawi. Foreign divorces may be recognized if they comply with local laws.","childCustody":"Custody is awarded based on the child’s welfare, with joint custody arrangements often considered.","propertyDivision":"Marital property is divided equitably, based on the contributions of each spouse and their financial needs."},"Lesotho":{"marriageRegistration":"Foreign marriages are recognized if they meet the legal standards of the country where they were performed. Registration with Lesotho authorities is optional but recommended.","divorceJurisdiction":"Divorce can be granted if one spouse is domiciled in Lesotho. Foreign divorces may be recognized under local standards.","childCustody":"Custody decisions prioritize the child's best interests, often leading to joint custody arrangements.","propertyDivision":"Marital property is divided equitably based on contributions and financial circumstances."},"Swaziland":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with Swazi authorities is recommended.","divorceJurisdiction":"Divorce is granted if one spouse resides in Eswatini. Foreign divorces may be recognized under local standards.","childCustody":"The child’s best interests guide custody decisions, often resulting in joint custody.","propertyDivision":"Marital property is divided equitably, considering each spouse's contributions."},"Comoros":{"marriageRegistration":"Recognized if legally performed abroad. Registration with Comoros authorities is advisable.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Comoros. Foreign divorces may be recognized under local standards.","childCustody":"Custody is decided based on the child’s welfare, with joint custody arrangements often considered.","propertyDivision":"Marital property is divided equitably based on contributions and financial needs."},"Gambia":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Gambian authorities is recommended.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Gambia. Foreign divorces may be recognized.","childCustody":"Custody is determined by the best interests of the child, often leading to shared custody.","propertyDivision":"Property is divided equitably, based on each spouse's contributions and needs."},"Angola":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country where they were performed. Registration with Angolan authorities is recommended for documentation purposes.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in Angola. Foreign divorces may be recognized under local laws.","childCustody":"Custody decisions are based on the child’s welfare, with joint custody arrangements common.","propertyDivision":"Marital property is divided equitably based on each spouse's contributions and financial needs."},"Burundi":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with Burundian authorities is advised.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Burundi. Foreign divorces may be recognized.","childCustody":"Custody decisions focus on the child’s welfare, often leading to joint custody arrangements.","propertyDivision":"Marital assets are divided equitably based on contributions and financial circumstances."},"Chad":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country of origin. Registration with Chadian authorities is recommended.","divorceJurisdiction":"Divorce is granted if one spouse resides in Chad. Foreign divorces may be recognized if they comply with local laws.","childCustody":"Custody decisions prioritize the child’s welfare, with joint custody arrangements often preferred.","propertyDivision":"Property is divided equitably based on contributions and financial needs."},"Central African Republic":{"marriageRegistration":"Foreign marriages are recognized if they meet the legal standards of the country where they were performed. Registration with local authorities is recommended.","divorceJurisdiction":"Courts grant divorces if one spouse is domiciled in CAR. Foreign divorces may be recognized if compliant with local standards.","childCustody":"Decisions are made in the best interests of the child, with joint custody often awarded.","propertyDivision":"Property acquired during marriage is divided equitably, based on contributions and financial circumstances."},"Congo":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with the Congolese authorities is recommended for documentation.","divorceJurisdiction":"Divorce is granted if one spouse resides in the Republic of Congo. Foreign divorces may be recognized.","childCustody":"Custody decisions are based on the child’s best interests, with joint custody often being awarded.","propertyDivision":"Property is divided equitably, taking into account each spouse’s contributions."},"Democratic Republic of the Congo":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country where they were performed. Registration with DRC authorities is advisable.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled in DRC. Foreign divorces may be recognized if compliant with local laws.","childCustody":"Custody is determined based on the best interests of the child, often resulting in joint custody.","propertyDivision":"Marital property is divided equitably, considering contributions and financial needs."},"Djibouti":{"marriageRegistration":"Recognized if legally performed abroad, especially if it complies with Islamic law for Muslims. Registration with Djiboutian authorities is advisable.","divorceJurisdiction":"Governed by Islamic law for Muslims. Foreign divorces may be recognized if legally valid.","childCustody":"Custody is typically granted to mothers for young children, following Islamic principles. Fathers may obtain custody as children grow older.","propertyDivision":"Islamic law applies, meaning marital property is not typically shared; assets are divided based on individual ownership."},"Eritrea":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country of origin. Registration with Eritrean authorities is recommended for documentation purposes.","divorceJurisdiction":"Divorce is granted if one spouse resides in Eritrea. Foreign divorces may be recognized if they comply with local laws.","childCustody":"Custody decisions are made in the best interests of the child, with joint custody common.","propertyDivision":"Property is divided equitably based on the couple's contributions and financial situation."},"Guinea":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Guinean authorities is recommended.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in Guinea. Foreign divorces may be recognized.","childCustody":"Custody decisions prioritize the child’s best interests, with joint custody often awarded.","propertyDivision":"Marital property is divided equitably, based on contributions and needs."},"Guinea-Bissau":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid. Registration with local authorities is optional but recommended for documentation.","divorceJurisdiction":"Divorce is granted if one spouse resides in Guinea-Bissau. Foreign divorces may be recognized under local laws.","childCustody":"Decisions are based on the best interests of the child, often leading to joint custody arrangements.","propertyDivision":"Marital assets are divided equitably based on contributions and future financial needs."},"Liberia":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Liberian authorities is optional but recommended.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Liberia. Foreign divorces may be recognized.","childCustody":"Custody is awarded based on the child’s welfare, often leading to joint custody.","propertyDivision":"Marital property is divided equitably, based on each spouse's contributions and financial situation."},"Libya":{"marriageRegistration":"Foreign marriages are recognized if legally valid, but Islamic law applies for Muslims. Registration with Libyan authorities is recommended.","divorceJurisdiction":"Governed by Islamic law for Muslims, foreign divorces may be recognized if compliant with local standards.","childCustody":"Custody typically follows Islamic principles, with mothers getting custody of young children and fathers later obtaining custody as children grow older.","propertyDivision":"Marital property is not typically shared under Islamic law; assets are divided based on ownership."},"Mali":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Malian authorities is advised.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Mali. Foreign divorces may be recognized.","childCustody":"Custody decisions are based on the child’s best interests, often resulting in joint custody.","propertyDivision":"Property acquired during the marriage is divided equitably based on contributions and financial needs."},"Mauritania":{"marriageRegistration":"Recognized if legally performed abroad, but must comply with Islamic law for Muslims. Registration with Mauritanian authorities is advised.","divorceJurisdiction":"Governed by Islamic law for Muslims. Foreign divorces may be recognized if compliant with local standards.","childCustody":"Custody is determined by Islamic principles, with mothers typically getting custody of young children.","propertyDivision":"Islamic law applies, meaning marital property is not necessarily shared; assets are divided based on ownership."},"Niger":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Nigerien authorities is recommended.","divorceJurisdiction":"Divorce is granted if one spouse resides in Niger. Foreign divorces may be recognized if they meet local standards.","childCustody":"Custody decisions prioritize the child’s welfare, often resulting in shared custody.","propertyDivision":"Property is divided equitably based on each spouse's contributions and financial situation."},"OCEANIA":{"marriageRegistration":"","divorceJurisdiction":"","childCustody":"","propertyDivision":""},"Australia":{"marriageRegistration":"Marriages performed abroad are recognized in Australia if they are valid in the country where they occurred. It is not necessary to register a foreign marriage in Australia, but it’s recommended for documentation.","divorceJurisdiction":"Courts can grant divorces if one spouse is domiciled or ordinarily resident in Australia. Foreign divorces are recognized if legally valid in the country where they were granted.","childCustody":"Decisions prioritize the child’s best interests, with shared custody or joint parenting often preferred.","propertyDivision":"Australia follows the principle of equitable distribution, meaning marital assets are divided based on fairness, considering factors like contributions, financial circumstances, and future needs."},"New Zealand":{"marriageRegistration":"Foreign marriages are recognized if they are valid where they occurred. Registration in New Zealand is not required.","divorceJurisdiction":"A divorce can be granted if one spouse resides in New Zealand. Foreign divorces may be recognized if compliant with New Zealand law.","childCustody":"Custody decisions are made in the best interests of the child, with shared custody or parenting common.","propertyDivision":"New Zealand follows a principle of equal sharing of relationship property, but contributions, financial needs, and future circumstances are considered in the division of assets."},"Fiji":{"marriageRegistration":"Marriages performed abroad are recognized if they comply with the laws of the country where they were performed. Registration with Fijian authorities is optional but recommended for documentation.","divorceJurisdiction":"Divorce is granted if one spouse resides in Fiji. Foreign divorces may be recognized if they comply with local legal standards.","childCustody":"Decisions are made in the best interests of the child, with shared custody being a common outcome.","propertyDivision":"Marital assets are divided equitably, based on the contributions of each spouse and their financial needs."},"Papua New Guinea":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country of origin. Registration with local authorities is recommended.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Papua New Guinea. Foreign divorces may be recognized if they comply with local standards.","childCustody":"Custody is awarded based on the child’s welfare, often resulting in shared custody.","propertyDivision":"Marital property is divided equitably, considering contributions and financial circumstances."},"Samoa":{"marriageRegistration":"Marriages performed abroad are recognized if they are legally valid in the country of origin. Registration with Samoan authorities is optional but recommended.","divorceJurisdiction":"Divorce is granted if one spouse resides in Samoa. Foreign divorces may be recognized if they meet local legal standards.","childCustody":"Custody decisions are based on the best interests of the child, with shared custody arrangements common.","propertyDivision":"Marital assets are divided equitably, based on contributions and financial needs."},"Tonga":{"marriageRegistration":"Foreign marriages are recognized if legally performed abroad. Registration with Tongan authorities is recommended for documentation purposes.","divorceJurisdiction":"Divorce can be granted if one spouse resides in Tonga. Foreign divorces may be recognized if they comply with local standards.","childCustody":"The child’s best interests guide custody decisions, with shared custody arrangements often preferred.","propertyDivision":"Marital property is divided equitably, based on each spouse’s contributions and financial situation."},"Vanuatu":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country where they were performed. Registration with Vanuatuan authorities is recommended.","divorceJurisdiction":"Courts grant divorces if one spouse resides in Vanuatu. Foreign divorces may be recognized if they meet local standards.","childCustody":"Custody decisions prioritize the welfare of the child, with shared custody being a common arrangement.","propertyDivision":"Marital property is divided equitably, based on the couple's contributions and financial circumstances."},"Solomon Islands":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country of origin. Registration with local authorities is optional but recommended for documentation.","divorceJurisdiction":"Courts can grant divorces if one spouse resides in the Solomon Islands. Foreign divorces may be recognized under local standards.","childCustody":"Decisions are made in the best interests of the child, often leading to joint custody.","propertyDivision":"Marital property is divided equitably based on contributions and financial circumstances."},"Kiribati":{"marriageRegistration":"Foreign marriages are recognized if legally valid where they were performed. Registration with Kiribati authorities is recommended for legal purposes.","divorceJurisdiction":"Divorce is granted if one spouse resides in Kiribati. Foreign divorces may be recognized under local legal standards.","childCustody":"The child’s welfare is the primary consideration in custody decisions, with shared custody arrangements being common.","propertyDivision":"Marital assets are divided equitably, considering each spouse’s contributions and financial needs."},"Tuvalu":{"marriageRegistration":"Foreign marriages are recognized if legally valid in the country of origin. Registration with Tuvaluan authorities is optional but recommended.","divorceJurisdiction":"Divorce is granted if one spouse resides in Tuvalu. Foreign divorces may be recognized if they meet local legal standards.","childCustody":"Custody decisions focus on the child’s welfare, with shared custody often awarded.","propertyDivision":"Marital assets are divided equitably, based on contributions and financial needs."},"Palau":{"marriageRegistration":"Marriages performed abroad are recognized if legally valid in the country where they were performed. Registration with Palauan authorities is recommended.","divorceJurisdiction":"Divorce can be granted if one spouse resides in Palau. Foreign divorces may be recognized if compliant with local laws.","childCustody":"Custody decisions are based on the best interests of the child, with joint custody arrangements being common.","propertyDivision":"Marital property is divided equitably, considering contributions and financial circumstances."},"Micronesia":{"marriageRegistration":"Foreign marriages are recognized if they are legally valid in the country of origin. Registration with Micronesian authorities is optional but recommended.","divorceJurisdiction":"Divorce is granted if one spouse resides in Micronesia. Foreign divorces may be recognized under local standards.","childCustody":"The child’s best interests guide custody decisions, often resulting in shared custody.","propertyDivision":"Property is divided equitably based on contributions and financial needs."}}